<script setup>
import AuthenticatedLayout from '@/Layouts/AuthenticatedLayout.vue';
import { Head } from '@inertiajs/vue3';
import PrimaryButton from '@/Components/Buttons/PrimaryButton.vue';
import { route } from 'ziggy-js';

const props = defineProps({
  services: Array
})

</script>

<template>

  <Head title="Огнезащита конструкций" />

  <AuthenticatedLayout>
		<template #header>
      <h2 class="leading-tight text-gray-800">
        Огнезащита конструкций
      </h2>
    </template>
    <div class="m-8 text-2xl text-justify font-light">
      <div class="flex mb-8">
        <img src="/images/fire_protection.png" alt="" class="rounded-[10px]">
        <span class="ml-8">
          <p>
            Огнезащитная обработка способствует длительному сопротивлению конструкций высоким температурам без потери несущих способностей, то есть увеличивает собственный предел огнестойкости защищаемых элементов, что также способствует уменьшению площади пожара и предотвращает возможное обрушение.
          </p>
          <br>
          <p>
            Согласно требованиям СП 2.13130.2009 «Системы противопожарной защиты. Обеспечение огнестойкости объектов защиты» здания и сооружения должны соответствовать определенной степени пожарной безопасности, защищаемые несущие элементы которых должны обладать указанным в нормативной документации пределом огнестойкости. Огнезащитная обработка конструкций проходит с применением специальных огнезащитных материалов. Расценка огнезащиты в смете необходима для точного распределения бюджета с учетом материалов, объема и трудозатрат.
          </p>
          <br>
          <p>
            Огнезащитная обработка включают в себя следующие основные функции:
          </p>
            <ul class="list-disc pl-10">
              <li>
                Проведение огнезащитной обработки снижает скорость распространения огня в помещениях, а также риск перехода огня на другие конструкции;
              </li>
              <li>
                Обработка огнезащитными составами увеличивает сопротивление конструкции высоким температурам и снижает риск обрушения здания или сооружения;
              </li>
            </ul>
        </span>
      </div>
      <div class="">
        <p>
          Мы проводим огнезащитную обработку в несколько этапов:
        </p>
        <ul class="list-disc pl-10">
          <li>
            Этап определения и выбора наиболее подходящего под технико-эксплуатационные параметры объекта материала или огнезащитной системы;
          </li>
          <li>
            Этап разработки проекта огнезащиты и согласование его в надзорных органах;
          </li>
          <li>
            Этап производства работ по огнезащитной обработке конструкций;
          </li>
          <li>
            Этап передачи выполненных работ по огнезащите представителям испытательной противопожарной лаборатории;
          </li>
          <li>
            Цена огнезащиты на каждом этапе зависит от индивидуальных особенностей проекта;
          </li>
        </ul>
      </div>
    </div>
    <div class="flex justify-center my-8 text-xl">
      <PrimaryButton
        >
        Перейти к оформлению заказа
      </PrimaryButton>
    </div>
  </AuthenticatedLayout>
</template>